        IDENTIFICATION DIVISION.
        PROGRAM-ID. PAGMU.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-RESP        PIC S9(8) COMP.
        01 WS-OPTION      PIC X.
        01 WS-SCREEN PIC X.
        01 WS-COMMAREA.
           05 CA-OPTION   PIC 9.
           05 CA-MSG      PIC X(50).
        01 AG-REC.
           05 CL-SCREEN PIC X.
           05 CL-AGENTID PIC 9(5).
        COPY AGMU.
        COPY DFHAID.
        LINKAGE SECTION.
        01 DFHCOMMAREA.
           05 CA-SCREEN PIC X.
           05 CA-AGENTID PIC X(5).
        PROCEDURE DIVISION.
        MAIN-LOGIC.
            IF EIBCALEN = 0
             MOVE LOW-VALUES TO AGMUO
             PERFORM SEND-SCREEN
            ELSE
                MOVE 'Y' TO CA-SCREEN
             IF CA-SCREEN = 'X'
                MOVE 'Y' TO CA-SCREEN
                MOVE LOW-VALUES TO AGMUO
                PERFORM SEND-SCREEN
             ELSE
              IF EIBAID = DFHPF3
               EXEC CICS XCTL PROGRAM('PLOGN')
               END-EXEC
              ELSE
                PERFORM RECEIVE-SCREEN

            END-IF.
               EXEC CICS RETURN
                 TRANSID('TAMU')
                 COMMAREA(WS-OPTION)
                 LENGTH(1)
               END-EXEC.
        RECEIVE-SCREEN.
                       EXEC CICS RECEIVE
                         MAP('AGMU')
                         MAPSET('AGMU')
                         INTO (AGMUI)
                       END-EXEC.
           MOVE OPTIONI TO WS-OPTION.
           EVALUATE WS-OPTION
            WHEN 1
             MOVE 'X' TO CL-SCREEN
             MOVE CA-AGENTID TO CL-AGENTID
             EXEC CICS XCTL PROGRAM('PAGCT')
             END-EXEC
      *                     COMMAREA(AG-REC)
      *                     LENGTH(6)
            WHEN 2
             MOVE 'X' TO CL-SCREEN
             MOVE CA-AGENTID TO CL-AGENTID
             EXEC CICS XCTL PROGRAM('PAGDEL')
             END-EXEC
      *                     COMMAREA(AG-REC)
      *                     LENGTH(6)
           END-EVALUATE.
          SEND-SCREEN.
            EXEC CICS SEND
             MAP('AGMU')
             MAPSET('AGMU')
             FREEKB
             ERASE
            END-EXEC.
